# Ms Thesis Wage Data Discovery

### Overview:

**To-Do's:**
* *Finish Data Gathering and Catalog Discovery for:*
 1. Wage Data
 2. Employment Data
 3. Trade Data
 4. FDI and FPI Data
 5. Decomposed Output Data
 6. Penn Table *(Controls)*

### Environment:

In [21]:
#Packages

import pandas as pd
import os
import eurostat

#Constants

dl=os.getcwd()[:-32]+'Data/Technology-Trade-Employment'

### Wages Data

Before discovering the data it is convenient to explain the datasets that will be used in the analysis briefly.
Studies conducted in the field of wage premia generally rely on population surveys to analyze premiums on more categories such as gender, age group, economic activity, and most importantly, occupation. European-level population surveys are conducted once in 4 years accessible from 2002 to 2018 with the names: *"European Community Household Panel (ECHP)" and "European Union Statistics on Income and Living Conditions (EU-SILC)"*. It is important to mention that the original, or raw, survey data is disaggregated *(individual level)* and not open for public access. It is possible to obtain the so-called, **microdata** with the proper request, though due to extended delivery time and short thesis deadline, this research will be conducted by aggregated, *(by certain categories)* datasets of **Eurostat**.

After browsiÌ‡ng the Eurostat Database, I ended up with the following three different data sets for the years 2002, 2006, 2010, 2014, 2018:

* Mean hourly earnings by sex, age, occupation for,
* Mean hourly earnings by sex, economic activity and occupation *(Not available for 2002)*,
* Mean hourly earnings by economic activity, sex, educational attainment level

For potential problems, it is good to check the data quality prior. Thereby we will import the data including the Flags which are:
 * b = break in time series, c = confidential, d = definition differs, see metadata, e = estimated, f = forecast, n = not significant, p = provisional, r = revised, s = Eurostat estimate, u = low reliability, z = not applicable.

I will check  ***n,p,u*** among these flags for wage and employment data from Eurostat and record it to the data catalog.

In [30]:
eurostat.get_pars('EARN_SES_AGT14')

['freq', 'age', 'unit', 'isco88', 'indic_se', 'sex', 'geo']

In [53]:
df=eurostat.get_data_df('EARN_SES_AGT14',True)
df.groupby(["2002_flag"])["2002_flag"].count()

2002_flag
     34270
s     2016
Name: 2002_flag, dtype: int64

In [56]:
df.dtypes

freq                       object
age                        object
unit                       object
isco88                     object
indic_se                   object
sex                        object
geo\TIME_PERIOD            object
2002_value                float64
2002_flag                  object
f                  string[python]
dtype: object

In [55]:
# Convert the "2002_flag" column to string type
df['f'] = df['2002_flag'].astype("string")

In [67]:
df.query('f == "s"').groupby(['geo\TIME_PERIOD'])['unit'].count()

geo\TIME_PERIOD
EA12    672
EU15    672
EU25    672
Name: unit, dtype: int64

Start by importing *Eurostat **EARN_SES_AGT14** Mean hourly earnings by sex, age, occupation for 2002* ðŸ“€

In [17]:
df02 = pd.read_csv(f'{dl}/Eurostat/csv/EARN_SES_AGT14.csv')
df02.dtypes

DATAFLOW        object
LAST UPDATE     object
freq            object
age             object
unit            object
isco88          object
indic_se        object
sex             object
geo             object
TIME_PERIOD      int64
OBS_VALUE      float64
OBS_FLAG        object
dtype: object

In [ ]:
df02.describe(include='all')[0:2]

,DATAFLOW,LAST UPDATE,freq,age,unit,isco88,indic_se,sex,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
count,36286,36286,36286,36286,36286,36286,36286,36286,36286,36286.0,36286.0,2016
unique,1,1,1,7,3,13,4,3,34,NaN,NaN,1

In [ ]:
print(df02["freq"].unique())
print(df02["age"].unique())
print(df02["unit"].unique())
print(df02["isco88"].unique())
print(df02["indic_se"].unique())
print(df02["sex"].unique())
print(df02["geo"].unique())
print(df02["TIME_PERIOD"].unique())

['A']
['TOTAL' 'UNK' 'Y30-39' 'Y40-49' 'Y50-59' 'Y_GE60' 'Y_LT30']
['EUR' 'PC' 'PPS']
['ISCO0' 'ISCO1' 'ISCO1-5' 'ISCO2' 'ISCO3' 'ISCO4' 'ISCO5' 'ISCO7'
 'ISCO7-9' 'ISCO8' 'ISCO9' 'TOTAL' 'UNK']
['ERN' 'OPAY' 'E_F_M_PC' 'OP_E_PC']
['F' 'M' 'T']
['CZ' 'EA' 'EU15' 'EU25' 'LT' 'NL' 'NMS10' 'NO' 'SI' 'AT' 'BE' 'BG' 'CY'
 'DE' 'DK' 'EA12' 'EE' 'EL' 'ES' 'FI' 'FR' 'HU' 'IE' 'IS' 'IT' 'LU' 'LV'
 'MT' 'PL' 'PT' 'RO' 'SE' 'SK' 'UK']
[2002]

Start by importing *Eurostat **EARN_SES06_14** Mean hourly earnings by sex, age, occupation for 2006* ðŸ“€

In [ ]:
df06 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES06_14.csv')
df06.dtypes

DATAFLOW        object
LAST UPDATE     object
freq            object
sizeclas        object
age             object
unit            object
isco88          object
indic_se        object
sex             object
geo             object
TIME_PERIOD      int64
OBS_VALUE      float64
OBS_FLAG        object
dtype: object

In [ ]:
df06.describe(include='all')[0:2]

,DATAFLOW,LAST UPDATE,freq,sizeclas,age,unit,isco88,indic_se,sex,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
count,61614,61614,61614,61614,61614,61614,61614,61614,61614,61614,61614.0,54440.0,7595
unique,1,1,1,2,7,3,14,4,3,35,NaN,NaN,2

In [ ]:
print(df06["freq"].unique())
print(df06["sizeclas"].unique())
print(df06["age"].unique())
print(df06["unit"].unique())
print(df06["isco88"].unique())
print(df06["indic_se"].unique())
print(df06["sex"].unique())
print(df06["geo"].unique())
print(df06["TIME_PERIOD"].unique())

['A']
['GE10' 'TOTAL']
['TOTAL' 'UNK' 'Y30-39' 'Y40-49' 'Y50-59' 'Y_GE60' 'Y_LT30']
['EUR' 'PC' 'PPS']
['ISCO0' 'ISCO1' 'ISCO1-5' 'ISCO2' 'ISCO3' 'ISCO4' 'ISCO5' 'ISCO6' 'ISCO7'
 'ISCO7-9' 'ISCO8' 'ISCO9' 'TOTAL' 'UNK']
['ERN' 'OPAY' 'E_F_M_PC' 'OP_E_PC']
['F' 'M' 'T']
['DK' 'EA13' 'EA16' 'EL' 'EU15' 'EU25' 'EU27_2007' 'HU' 'LT' 'NL' 'NO'
 'FI' 'AT' 'BE' 'BG' 'CY' 'CZ' 'DE' 'EE' 'ES' 'FR' 'IE' 'IS' 'IT' 'LU'
 'LV' 'MT' 'PL' 'PT' 'RO' 'SE' 'SI' 'SK' 'TR' 'UK']
[2006]

Start by importing *Eurostat **EARN_SES10_14** Mean hourly earnings by sex, age, occupation for 2010* ðŸ“€

In [83]:
df10 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES10_14.csv')
df10.dtypes

DATAFLOW        object
LAST UPDATE     object
freq            object
currency        object
indic_se        object
sizeclas        object
isco08          object
age             object
sex             object
geo             object
TIME_PERIOD      int64
OBS_VALUE      float64
OBS_FLAG        object
dtype: object

In [86]:
df10.describe(include='all')[0:2]

,DATAFLOW,LAST UPDATE,freq,currency,indic_se,sizeclas,isco08,age,sex,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
count,64628,64628,64628,64628,64628,64628,64628,64628,64628,64628,64628.0,63152.0,6223
unique,1,1,1,3,4,2,13,6,3,40,NaN,NaN,3

In [114]:
for i in df10.dtypes[df10.dtypes != "float64"].index:
    print(i)

DATAFLOW
LAST UPDATE
freq
currency
indic_se
sizeclas
isco08
age
sex
geo
TIME_PERIOD
OBS_FLAG

In [109]:
for i in df10.dtypes.index:
    print(i)

DATAFLOW
LAST UPDATE
freq
currency
indic_se
sizeclas
isco08
age
sex
geo
TIME_PERIOD
OBS_VALUE
OBS_FLAG

In [115]:
for i in df10.dtypes.index:
    print(df10[i].unique())

['ESTAT:EARN_SES10_14(1.0)']
['30/01/17 23:00:00']
['A']
['EUR' 'PC' 'PPS']
['ERN' 'OPAY' 'E_F_M_PC' 'OP_E_PC']
['GE10' 'TOTAL']
['OC0' 'OC1' 'OC1-5' 'OC2' 'OC3' 'OC4' 'OC5' 'OC6' 'OC7' 'OC7-9' 'OC8'
 'OC9' 'TOTAL']
['TOTAL' 'Y30-39' 'Y40-49' 'Y50-59' 'Y_GE60' 'Y_LT30']
['F' 'M' 'T']
['EU25' 'EU27_2007' 'EU28' 'HU' 'EA13' 'EA16' 'EA17' 'EU15' 'HR' 'NL' 'NO'
 'SI' 'AT' 'BE' 'BG' 'CH' 'CY' 'CZ' 'DE' 'DK' 'EE' 'EL' 'ES' 'FI' 'FR'
 'IE' 'IS' 'IT' 'LT' 'LU' 'LV' 'MK' 'MT' 'PL' 'PT' 'RO' 'SE' 'SK' 'TR'
 'UK']
[2010]
[ 7.72   nan 24.53 ... 29.85 24.72 33.61]
['s' 'c' nan 'd']

In [116]:
for i in df10.dtypes[df10.dtypes != "float64"].index:
    print(df10[i].unique())

['ESTAT:EARN_SES10_14(1.0)']
['30/01/17 23:00:00']
['A']
['EUR' 'PC' 'PPS']
['ERN' 'OPAY' 'E_F_M_PC' 'OP_E_PC']
['GE10' 'TOTAL']
['OC0' 'OC1' 'OC1-5' 'OC2' 'OC3' 'OC4' 'OC5' 'OC6' 'OC7' 'OC7-9' 'OC8'
 'OC9' 'TOTAL']
['TOTAL' 'Y30-39' 'Y40-49' 'Y50-59' 'Y_GE60' 'Y_LT30']
['F' 'M' 'T']
['EU25' 'EU27_2007' 'EU28' 'HU' 'EA13' 'EA16' 'EA17' 'EU15' 'HR' 'NL' 'NO'
 'SI' 'AT' 'BE' 'BG' 'CH' 'CY' 'CZ' 'DE' 'DK' 'EE' 'EL' 'ES' 'FI' 'FR'
 'IE' 'IS' 'IT' 'LT' 'LU' 'LV' 'MK' 'MT' 'PL' 'PT' 'RO' 'SE' 'SK' 'TR'
 'UK']
[2010]
['s' 'c' nan 'd']

In [71]:
cwd=os.getcwd()[:-4]
df18 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES18_14.csv')
df14 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES14_14.csv')
df10 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES10_14.csv')
df06 = pd.read_csv(f'{cwd}Data/Eurostat/csv/EARN_SES06_14.csv')
df06.head(4)

,DATAFLOW,LAST UPDATE,freq,sizeclas,age,unit,isco88,indic_se,sex,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:EARN_SES06_14(1.0),31/01/17 23:00:00,A,GE10,TOTAL,EUR,ISCO0,ERN,F,DK,2006,30.48,NaN
1,ESTAT:EARN_SES06_14(1.0),31/01/17 23:00:00,A,GE10,TOTAL,EUR,ISCO0,ERN,F,EA13,2006,10.90,NaN
2,ESTAT:EARN_SES06_14(1.0),31/01/17 23:00:00,A,GE10,TOTAL,EUR,ISCO0,ERN,F,EA16,2006,10.90,s
3,ESTAT:EARN_SES06_14(1.0),31/01/17 23:00:00,A,GE10,TOTAL,EUR,ISCO0,ERN,F,EL,2006,NaN,c

In [72]:
df14.currency.unique()
df14.geo.unique()
df14.isco08.unique()

array(['OC0', 'OC1', 'OC1-5', 'OC2', 'OC3', 'OC4', 'OC5', 'OC6', 'OC7',
       'OC7-9', 'OC8', 'OC9', 'TOTAL'], dtype=object)

In [73]:
df06.isco88.unique()

array(['ISCO0', 'ISCO1', 'ISCO1-5', 'ISCO2', 'ISCO3', 'ISCO4', 'ISCO5',
       'ISCO6', 'ISCO7', 'ISCO7-9', 'ISCO8', 'ISCO9', 'TOTAL', 'UNK'],
      dtype=object)

In [74]:
df18=df18.drop(['DATAFLOW', 'LAST UPDATE', 'freq','OBS_FLAG' ], axis=1)
df_NL_18=df18[(df18["geo"] == 'NL') & (df18["unit"] == 'EUR') & (df18["isco08"].isin(['OC1','OC5','OC9']))
            & (df18["sex"] == 'T') & (df18["age"] == 'TOTAL') & (df18["sizeclas"] == 'TOTAL')
            & (df18["indic_se"] == 'ERN' )]

In [75]:
df14=df14.drop(['DATAFLOW', 'LAST UPDATE', 'freq','OBS_FLAG' ], axis=1)
df_NL_14=df14[(df14["geo"] == 'NL') & (df14["currency"] == 'EUR') & (df14["isco08"].isin(['OC1','OC5','OC9']))
            & (df14["sex"] == 'T') & (df14["age"] == 'TOTAL') & (df14["sizeclas"] == 'TOTAL')
            & (df14["indic_se"] == 'ERN' )]

In [76]:
df10=df10.drop(['DATAFLOW', 'LAST UPDATE', 'freq','OBS_FLAG' ], axis=1)
df_NL_10=df10[(df10["geo"] == 'NL') & (df10["currency"] == 'EUR') & (df10["isco08"].isin(['OC1','OC5','OC9']))
            & (df10["sex"] == 'T') & (df10["age"] == 'TOTAL') & (df10["sizeclas"] == 'TOTAL')
            & (df10["indic_se"] == 'ERN' )]

In [77]:
df06=df06.drop(['DATAFLOW', 'LAST UPDATE', 'freq','OBS_FLAG'], axis=1)
df_NL_06=df06[(df06["geo"] == 'NL') & (df06["unit"] == 'EUR')& (df06["isco88"].isin(['ISCO1','ISCO5','ISCO9']))
            & (df06["sex"] == 'T') & (df06["age"] == 'TOTAL') & (df06["sizeclas"] == 'TOTAL')
            & (df06["indic_se"] == 'ERN' )]

### Import of additional years

In [78]:
df_NL_18

        age indic_se isco08 sex sizeclas unit geo  TIME_PERIOD  OBS_VALUE
692   TOTAL      ERN    OC1   T    TOTAL  EUR  NL         2018      33.51
3302  TOTAL      ERN    OC5   T    TOTAL  EUR  NL         2018      12.97
6374  TOTAL      ERN    OC9   T    TOTAL  EUR  NL         2018      10.46

In [79]:
df_NL_14

      currency indic_se sizeclas isco08    age sex geo  TIME_PERIOD  OBS_VALUE
8835       EUR      ERN    TOTAL    OC1  TOTAL   T  NL         2014      30.50
10565      EUR      ERN    TOTAL    OC5  TOTAL   T  NL         2014      12.34
12191      EUR      ERN    TOTAL    OC9  TOTAL   T  NL         2014      10.42

In [80]:
df_NL_10

      currency indic_se sizeclas isco08    age sex geo  TIME_PERIOD  OBS_VALUE
8731       EUR      ERN    TOTAL    OC1  TOTAL   T  NL         2010      28.15
10257      EUR      ERN    TOTAL    OC5  TOTAL   T  NL         2010      12.16
11678      EUR      ERN    TOTAL    OC9  TOTAL   T  NL         2010      10.04

In [81]:
df_NL_06

      sizeclas    age unit isco88 indic_se sex geo  TIME_PERIOD  OBS_VALUE
40932    TOTAL  TOTAL  EUR  ISCO1      ERN   T  NL         2006      23.60
41412    TOTAL  TOTAL  EUR  ISCO5      ERN   T  NL         2006      11.03
41941    TOTAL  TOTAL  EUR  ISCO9      ERN   T  NL         2006       9.73

In [82]:
pd.concat([df_NL_06,df_NL_10,df_NL_14,df_NL_18]).head(12)

,sizeclas,age,unit,isco88,indic_se,sex,geo,TIME_PERIOD,OBS_VALUE,currency,isco08
40932,TOTAL,TOTAL,EUR,ISCO1,ERN,T,NL,2006,23.60,NaN,NaN
41412,TOTAL,TOTAL,EUR,ISCO5,ERN,T,NL,2006,11.03,NaN,NaN
41941,TOTAL,TOTAL,EUR,ISCO9,ERN,T,NL,2006,9.73,NaN,NaN
8731,TOTAL,TOTAL,NaN,NaN,ERN,T,NL,2010,28.15,EUR,OC1
10257,TOTAL,TOTAL,NaN,NaN,ERN,T,NL,2010,12.16,EUR,OC5
11678,TOTAL,TOTAL,NaN,NaN,ERN,T,NL,2010,10.04,EUR,OC9
8835,TOTAL,TOTAL,NaN,NaN,ERN,T,NL,2014,30.50,EUR,OC1
10565,TOTAL,TOTAL,NaN,NaN,ERN,T,NL,2014,12.34,EUR,OC5
12191,TOTAL,TOTAL,NaN,NaN,ERN,T,NL,2014,10.42,EUR,OC9
692,TOTAL,TOTAL,EUR,NaN,ERN,T,NL,2018,33.51,NaN,OC1
3302,TOTAL,TOTAL,EUR,NaN,ERN,T,NL,2018,12.97,NaN,OC5
6374,TOTAL,TOTAL,EUR,NaN,ERN,T,NL,2018,10.46,NaN,OC9